tap "grishka/grishka"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: :changed
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Display and control your Android device
brew "scrcpy"
# Programmatically correct mistyped console commands
brew "thefuck"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# Terminal-based AI coding assistant
cask "claude-code"
# Unofficial Google Nearby Share app
cask "grishka/grishka/neardrop"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
vscode "adpyke.codesnap"
vscode "agurodriguez.vscode-lbnf"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "anweber.vscode-httpyac"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "codingyu.laravel-goto-view"
vscode "ctf0.laravel-goto-controller"
vscode "damms005.devdb"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-typescript-exportallmodules"
vscode "esbenp.prettier-vscode"
vscode "felixangelov.bloc"
vscode "flutterando.flutter-coverage"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "georgykurian.laravel-ide-helper"
vscode "ghgofort.neon-vommit"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glitchbl.laravel-create-view"
vscode "gornivv.vscode-flutter-files"
vscode "hwencc.html-tag-wrapper"
vscode "iceworks-team.iceworks-refactor"
vscode "ihunte.laravel-blade-wrapper"
vscode "infeng.vscode-react-typescript"
vscode "jeroen-meijer.pubspec-assist"
vscode "jock.svg"
vscode "kakumei.php-xdebug"
vscode "kakumei.ts-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mikhail-arkhipov.r"
vscode "miquelddg.dart-barrel-file-generator"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naoray.laravel-goto-components"
vscode "nash.awesome-flutter-snippets"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "openai.chatgpt"
vscode "patcx.vscode-nuget-gallery"
vscode "peaceshi.syntax-highlight"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pranaygp.vscode-css-peek"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "ryannaddy.laravel-artisan"
vscode "sergelamikhov.lcov-lang"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shufo.vscode-blade-formatter"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tintrinh.php-refactor"
vscode "vivaxy.vscode-conventional-commits"
vscode "wayou.vscode-todo-highlight"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yoavbls.pretty-ts-errors"
