adpyke.codesnap
agurodriguez.vscode-lbnf
amiralizadeh9480.laravel-extra-intellisense
anweber.vscode-httpyac
aykutsarac.jsoncrack-vscode
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
charliermarsh.ruff
christian-kohler.path-intellisense
codeium.codeium
codingyu.laravel-goto-view
ctf0.laravel-goto-controller
damms005.devdb
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
docker.docker
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
eliostruyf.vscode-typescript-exportallmodules
esbenp.prettier-vscode
felixangelov.bloc
flutterando.flutter-coverage
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
fwcd.kotlin
georgykurian.laravel-ide-helper
ghgofort.neon-vommit
github.copilot-chat
github.vscode-github-actions
glitchbl.laravel-create-view
gornivv.vscode-flutter-files
hwencc.html-tag-wrapper
iceworks-team.iceworks-refactor
ihunte.laravel-blade-wrapper
infeng.vscode-react-typescript
jeroen-meijer.pubspec-assist
jock.svg
kakumei.php-xdebug
kakumei.ts-debug
mathiasfrohlich.kotlin
mechatroner.rainbow-csv
mikestead.dotenv
mikhail-arkhipov.r
miquelddg.dart-barrel-file-generator
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-pack
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cpptools
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
naoray.laravel-goto-components
nash.awesome-flutter-snippets
naumovs.color-highlight
nrwl.angular-console
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
onecentlin.laravel5-snippets
openai.chatgpt
patcx.vscode-nuget-gallery
peaceshi.syntax-highlight
pgl.laravel-jump-controller
pkief.material-icon-theme
planbcoding.vscode-react-refactor
pranaygp.vscode-css-peek
rdebugger.r-debugger
reditorsupport.r
reditorsupport.r-syntax
ritwickdey.liveserver
ryannaddy.laravel-artisan
sergelamikhov.lcov-lang
shd101wyy.markdown-preview-enhanced
shufo.vscode-blade-formatter
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tintrinh.php-refactor
vivaxy.vscode-conventional-commits
wayou.vscode-todo-highlight
xdebug.php-debug
xdebug.php-pack
yoavbls.pretty-ts-errors
